## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 24 to add, 1 to change, 11 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                   |
|----------|---------------------------------------------------------------------------------------------------------|
| add      | `aws_acm_certificate_validation.notification-canada-ca`                                                 |
|          | `aws_acm_certificate_validation.notification-canada-ca-alt`                                             |
|          | `aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs`                                  |
|          | `aws_route53_record.api-k8s-scratch-notification-sandbox-CNAME[0]`                                      |
|          | `aws_route53_record.api-weighted-0-scratch-notification-sandbox-A[0]`                                   |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.api.staging.notification.alpha.cdssandbox.xyz&quot;]`      |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.document.staging.notification.alpha.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;*.staging.notification.alpha.cdssandbox.xyz&quot;]`          |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;api.staging.notification.alpha.cdssandbox.xyz&quot;]`        |
|          | `aws_route53_record.notification-canada-ca-alt[&quot;staging.notification.alpha.cdssandbox.xyz&quot;]`            |
|          | `aws_route53_record.notification-canada-ca[&quot;*.api.staging.notification.cdssandbox.xyz&quot;]`                |
|          | `aws_route53_record.notification-canada-ca[&quot;*.document.staging.notification.cdssandbox.xyz&quot;]`           |
|          | `aws_route53_record.notification-canada-ca[&quot;*.staging.notification.cdssandbox.xyz&quot;]`                    |
|          | `aws_route53_record.notification-canada-ca[&quot;api.staging.notification.cdssandbox.xyz&quot;]`                  |
|          | `aws_route53_record.notification-canada-ca[&quot;staging.notification.cdssandbox.xyz&quot;]`                      |
|          | `module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                       |
|          | `module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                 |
|          | `module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                   |
|          | `module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                 |
|          | `module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                   |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]`  |
|          | `module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]`  |
| delete   | `aws_route53_record.notification-canada-ca-alt[0]`                                                      |
|          | `aws_route53_record.notification-canada-ca[0]`                                                          |
|          | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                          |
|          | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                    |
|          | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                      |
|          | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                    |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                      |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]`     |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]`     |
| update   | `aws_ec2_managed_prefix_list.google_cidrs`                                                              |
| recreate | `aws_cloudwatch_log_subscription_filter.admin_api_request[0]`                                           |
|          | `aws_cloudwatch_log_subscription_filter.blazer_logging[0]`                                              |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/4984030157).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate_validation.notification-canada-ca will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/db0b2d43-d054-4c2f-b991-a946f665b445"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-eks-application-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.admin_api_request[0] must be replaced
  # (moved from aws_cloudwatch_log_subscription_filter.admin_api_request)
-/+ resource "aws_cloudwatch_log_subscription_filter" "admin_api_request" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder" -> (known after apply) # forces replacement
      ~ id              = "cwlsf-536729344" -> (known after apply)
        name            = "Admin API request"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.blazer_logging[0] must be replaced
  # (moved from aws_cloudwatch_log_subscription_filter.blazer_logging)
-/+ resource "aws_cloudwatch_log_subscription_filter" "blazer_logging" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder" -> (known after apply) # forces replacement
      ~ id              = "cwlsf-1214848348" -> (known after apply)
        name            = "Blazer logging"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_ec2_managed_prefix_list.google_cidrs will be updated in-place
  ~ resource "aws_ec2_managed_prefix_list" "google_cidrs" {
        id             = "pl-0b6237ea4ffab2184"
      ~ max_entries    = 100 -> 20
        name           = "Google Service CIDRs"
        tags           = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)

        # (72 unchanged blocks hidden)
    }

  # aws_route53_record.api-k8s-scratch-notification-sandbox-CNAME[0] will be created
  + resource "aws_route53_record" "api-k8s-scratch-notification-sandbox-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api-k8s.staging.notification.cdssandbox.xyz"
      + records         = [
          + "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.api-weighted-0-scratch-notification-sandbox-A[0] will be created
  + resource "aws_route53_record" "api-weighted-0-scratch-notification-sandbox-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.staging.notification.cdssandbox.xyz"
      + set_identifier  = "loadbalancer"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-staging-alb-1878361959.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }

      + weighted_routing_policy {
          + weight = 0
        }
    }

  # aws_route53_record.notification-canada-ca[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route53_record" "notification-canada-ca" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz" -> null
      - records                          = [
          - "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca["*.api.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.document.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_b4c1dfe3fa5ef9427b62475bf31154f3.document.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_aa51db2fea1aaaa2486be78695309fd4.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["*.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_a3c8bd5843dfed42acc803da5f589492.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["api.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca["staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_5bc41be686a84b97346535d7c4d2fe4e.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_a3c8bd5843dfed42acc803da5f589492.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route53_record" "notification-canada-ca-alt" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz.notification.cdssandbox.xyz" -> null
      - id                               = "Z04028033PLSHVOO9ZJ1Z__e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz" -> null
      - records                          = [
          - "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> null
    }

  # aws_route53_record.notification-canada-ca-alt["*.api.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.document.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_0b470ab7b948ce2073da749061c99afa.document.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_3b9faf7a03aadc824ded19cf529bf3dd.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["*.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["api.staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt["staging.notification.alpha.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_61506a51477cc0c185214e1e236c1ebd.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_b64b3e23bcbf064b6575422707914bbd.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - id                = "/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - name              = "/aws/lambda/sentinel-cloud-watch-forwarder" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "notification-canada-ca-staging"
        } -> null
      - tags_all          = {
          - "CostCentre" = "notification-canada-ca-staging"
        } -> null
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      - arn       = "arn:aws:iam::239043911459:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - id        = "arn:aws:iam::239043911459:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - name      = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/sentinel-cloud-watch-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4R6EZ5GMH7E" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_iam_role" "sentinel_forwarder_lambda" {
      - arn                   = "arn:aws:iam::239043911459:role/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-25T14:49:11Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::239043911459:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-05-15T17:18:56Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RVP2HMJ45G" -> null

      - inline_policy {}
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      - id         = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder-20221125144914744500000001" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - role       = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_function" "sentinel_forwarder" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "Lambda function to forward AWS logs to Azure Sentinel" -> null
      - filename                       = "/tmp/sentinel_forwarder.py.zip" -> null
      - function_name                  = "sentinel-cloud-watch-forwarder" -> null
      - handler                        = "sentinel_forwarder.lambda_handler" -> null
      - id                             = "sentinel-cloud-watch-forwarder" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2023-01-23T14:08:56.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:37",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:sentinel-cloud-watch-forwarder:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::239043911459:role/SentinelForwarderLambda-sentinel-cloud-watch-forwarder" -> null
      - runtime                        = "python3.9" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw=" -> null
      - source_code_size               = 300 -> null
      - tags                           = {
          - "CostCentre" = "notification-canada-ca-staging"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "notification-canada-ca-staging"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CUSTOMER_ID" = (sensitive)
              - "LOG_TYPE"    = "ApplicationLog"
              - "SHARED_KEY"  = (sensitive)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "Active" -> null
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sentinel-cloud-watch-forwarder" -> null
      - id            = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> null
      - principal     = "logs.ca-central-1.amazonaws.com" -> null
      - source_arn    = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application:*" -> null
      - statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0" -> null
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be destroyed
  # (because module.sentinel_forwarder is not in configuration)
  - resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "sentinel-cloud-watch-forwarder" -> null
      - id            = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> null
      - principal     = "logs.ca-central-1.amazonaws.com" -> null
      - source_arn    = "arn:aws:logs:ca-central-1:239043911459:log-group:blazer:*" -> null
      - statement_id  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1" -> null
    }

  # module.sentinel_forwarder[0].data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sentinel-cloud-watch-forwarder"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
    }

  # module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
    }

  # module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-cloud-watch-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:37",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID" = (sensitive)
              + "LOG_TYPE"    = "ApplicationLog"
              + "SHARED_KEY"  = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

  #...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
